{
  "start_quest": {
    "text": "Il vento sussurra notizie di sventura: la Principessa Aurora è stata rapita e portata in un castello avvolto dalla nebbia, ben oltre i confini del tuo regno. Il richiamo dell'avventura brucia nel tuo petto, Principe.",
    "actions": {
      "Parti per la missione di salvataggio": "forest_edge"
    }
  },
  "forest_edge": {
    "text": "Lasciandoti alle spalle le mura rassicuranti del tuo regno, ti trovi ai margini della Selva Oscura, un groviglio di alberi antichi e sentieri ingannevoli. La leggenda narra che pochi ne sono tornati.",
    "actions": {
      "Addentrati nella Selva Oscura": "deep_forest"
    }
  },
  "deep_forest": {
    "text": "Ogni passo nella foresta è un labirinto. Rami scheletrici si protendono come artigli, e l'oscurità è quasi palpabile. Dopo ore di orientamento difficile, riesci a trovare un percorso attraverso il cuore del labirinto.",
    "actions": {
      "Prosegui verso il ponte": "bridge_approach"
    }
  },
  "bridge_approach": {
    "text": "Finalmente, la foresta si dirada, rivelando un antico ponte di pietra che si estende su un abisso nebbioso. A guardia del ponte, si erge una creatura mitologica, un Gryphon dagli occhi ardenti. Non sembra intenzionata a lasciarti passare.",
    "actions": {
      "Affronta il Guardiano": "guardian_battle"
    }
  },
  "guardian_battle": {
    "text": "Il Gryphon ruggisce, e l'aria si riempie del clangore del combattimento. Colpo dopo colpo, la tua spada si scontra con le sue scaglie, fino a quando, con un'ultima mossa decisiva, la creatura crolla e il ponte è libero.",
    "actions": {
      "Attraversa il ponte": "mountain_base"
    }
  },
  "mountain_base": {
    "text": "Superato il ponte, una catena montuosa si erge maestosa e minacciosa. Le vette sono avvolte in nubi tempestose, e i sentieri sembrano svanire nel nulla. È una scalata che metterebbe alla prova anche lo scalatore più esperto.",
    "actions": {
      "Inizia l'ascesa impervia": "mountain_climb"
    }
  },
  "mountain_climb": {
    "text": "Il vento gelido ti sferza, e ogni appiglio è precario. Con determinazione ferrea, superi crepacci insidiosi e pareti a strapiombo, mentre il castello della principessa si avvicina, solitario e imponente, in lontananza.",
    "actions": {
      "Raggiungi la cima e la fortezza": "castle_exterior"
    }
  },
  "castle_exterior": {
    "text": "Dopo un'estenuante scalata, ti trovi davanti alle mura del castello, alte e minacciose. L'aria è densa di magia oscura, e ogni ombra sembra nascondere una minaccia. La principessa è vicina, ma la fortezza è un ultimo, terribile ostacolo.",
    "actions": {
      "Trova un ingresso segreto": "castle_interior"
    }
  },
  "castle_interior": {
    "text": "All'interno, il castello è un labirinto di corridoi bui, trappole nascoste e antichi enigmi. Con intelligenza e coraggio, riesci a decifrare gli indovinelli e a disattivare le trappole che ti sbarrano il passo.",
    "actions": {
      "Supera le sfide del castello": "princess_chamber"
    }
  },
  "princess_chamber": {
    "text": "Finalmente, dopo aver sventato l'ultima trappola, sfondi la porta della camera in cui è tenuta prigioniera la Principessa Aurora. I suoi occhi si illuminano di speranza al tuo arrivo. La tua missione è quasi compiuta.",
    "actions": {
      "Libera la Principessa": "return_mountain"
    }
  },
  "return_mountain": {
    "text": "Con la Principessa Aurora al tuo fianco, inizi la difficile discesa dalla montagna. Il pericolo non è svanito, ma ora la speranza brilla più luminosa ad ogni passo verso casa. La discesa è lenta ma sicura.",
    "actions": {
      "Discendi la montagna con la principessa": "return_bridge"
    }
  },
  "return_bridge": {
    "text": "Raggiungete il ponte dove il Gryphon è caduto. Il suo corpo giace immobile, monito di sfide superate. L'attraversamento è più sereno, ma la strada è ancora lunga.",
    "actions": {
      "Attraversa il ponte con la principessa": "return_forest"
    }
  },
  "return_forest": {
    "text": "La Selva Oscura vi accoglie di nuovo, ma questa volta, la sua oscurità sembra meno minacciosa con la principessa al tuo fianco. Trovi i sentieri che hai già percorso, desideroso di lasciare questo luogo inquietante.",
    "actions": {
      "Percorri la foresta con la principessa": "return_kingdom_gate"
    }
  },
  "return_kingdom_gate": {
    "text": "Le luci del tuo regno appaiono all'orizzonte, un faro di salvezza. Superata l'ultima minaccia della foresta, le porte del castello si aprono per accogliervi, e le campane suonano a festa per il vostro ritorno.",
    "actions": {
      "Riporta la Principessa al sicuro nel regno": "grand_reunion"
    }
  },
  "grand_reunion": {
    "text": "La Principessa Aurora è finalmente al sicuro, accolta dal giubilo del popolo. Sei un eroe, Principe, e la tua leggenda di coraggio e amore sarà narrata per sempre, ricordando l'audacia che ha riportato la luce nel regno.",
    "actions": {}
  }
}