{
  "start_village": {
    "text": "Nel villaggio oppresso dalla siccità, dove la Fonte Magica è spenta e la speranza vacilla, la giovane Elia, custode di innumerevoli storie, sente una chiamata. Il suo cuore semplice e coraggioso è pronto a sfidare il timore che lega gli altri. Decide di agire.",
    "actions": {
      "Partire per trovare la Fonte Magica": "forest_edge_1"
    }
  },
  "forest_edge_1": {
    "text": "Elia lascia le case silenziose, avventurandosi ai margini della foresta. L'aria si fa più fresca, l'ombra degli alberi più densa. Il sentiero, appena visibile, si perde tra foglie e radici, sussurrando antichi segreti.",
    "actions": {
      "Seguire il sentiero nel profondo del bosco": "forest_depths_1",
      "Cercare un sentiero alternativo lungo il fiume secco": "forest_edge_2"
    }
  },
  "forest_edge_2": {
    "text": "Il fiume è prosciugato, e il percorso si rivela un vicolo cieco. Il silenzio della foresta sembra farsi più cupo, ma Elia non si arrende. Sente che la vera via è quella maestra, tracciata solo per lei.",
    "actions": {
      "Tornare sul sentiero principale e addentrarsi": "forest_depths_1"
    }
  },
  "forest_depths_1": {
    "text": "Dopo un lungo cammino nel cuore pulsante della foresta, dove la luce filtra a stento e ogni suono è amplificato, Elia la vede: la Fonte Magica. È immobile, spenta, un semplice stagno scuro e silenzioso. Ma Elia sa che la sua vera essenza è solo addormentata, in attesa di un soffio di speranza.",
    "actions": {
      "Raccontare alla Fonte una storia di speranza": "fountain_awakening_1"
    }
  },
  "fountain_awakening_1": {
    "text": "Elia chiude gli occhi e intona una storia, le parole intessono fili d'oro nell'aria. È una storia di resilienza, di luce che vince l'ombra, di un piccolo seme che germoglia. La Fonte risponde: l'acqua inizia a brillare con mille colori, poi a fluire con una melodia cristallina, traboccando di vita e magia!",
    "actions": {
      "Osservare la magia dispiegarsi": "victory_1"
    }
  },
  "victory_1": {
    "text": "Come un abbraccio del cielo, una pioggia dolce e gentile inizia a cadere sul villaggio, lavando via la siccità e riempiendo i cuori di gioia. Elia ha compiuto la sua missione, dimostrando che anche la più semplice delle voci può risvegliare la magia più grande. La speranza è tornata, e il mondo è di nuovo vibrante.",
    "actions": {}
  }
}